app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("studentId", "name", "phone", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["studentId", 12250], ["name", "Tom"], ["phone", "18201605311"], ["address", "beijing"], ["created_at", "2017-11-07 04:11:12.184559"], ["updated_at", "2017-11-07 04:11:12.184559"]]

  def update
    respond_to do |format|
      if @student.update(student_params)
---
UPDATE "students" SET "address" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["address", "BeiJing"], ["updated_at", "2017-11-07 10:12:45.748051"], ["id", 1]]

  def destroy
    @student.destroy
---
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 4]]